app/Models/PostModel.php

SELECT COUNT(*) AS `numrows`
FROM `post`
JOIN `utenti` ON `post`.`id_user` = `utenti`.`id_user`
WHERE `post`.`id_topic` = '24'
---
    public function getTopicPosts($id_topic, $perPage = 10)
    {
        return $this->select('post.testo, utenti.username, post.data_ora, post.id_post')
            ->join('utenti', 'post.id_user = utenti.id_user')
            ->where('post.id_topic', $id_topic)
            ->orderby('post.id_post', 'ASC')
            //Magica funzione di CodeIgniter per la paginazione
            ->paginate($perPage);