app/Models/TopicModel.php

SELECT COUNT(*) AS `numrows`
FROM `topic`
JOIN `utenti` ON `topic`.`id_user` = `utenti`.`id_user`
SELECT `topic`.`id_topic`, `topic`.`titolo`, `utenti`.`username`
FROM `topic`
JOIN `utenti` ON `topic`.`id_user` = `utenti`.`id_user`
 LIMIT 10
---
    public function getTopics($perPage = 10)
    {
        return $this->select('topic.id_topic, topic.titolo, utenti.username')
            ->join('utenti', 'topic.id_user = utenti.id_user')
            ->paginate($perPage);

SELECT `topic`.`id_topic`, `topic`.`titolo`, `utenti`.`username`
FROM `topic`
JOIN `utenti` ON `topic`.`id_user` = `utenti`.`id_user`
WHERE `topic`.`id_topic` = '20'
 LIMIT 1
---
    public function getUserTopic($id_topic)
    {
        return $this->select('topic.id_topic, topic.titolo, utenti.username')
            ->join('utenti', 'topic.id_user = utenti.id_user')
            ->where('topic.id_topic', $id_topic)
            ->first();

INSERT INTO `topic` (`titolo`, `id_user`) VALUES ('<script> alert(1); </script>', '10')
---
    public function newTopic($titolo)
    {
        return $this->insert([
            'titolo' => $titolo,
            'id_user' => session()->get('user_id')
        ]);