app/Models/TopicModel.php

DELETE FROM `topic`
WHERE `id_topic` IN (29)
---
    public function deleteTopic($id_topic)
    {
        return $this->delete($id_topic);