app/Models/TopicPageModel.php

    public function getTopicPosts($id_topic, $perPage = 10)
    {
        return $this->select('post.testo, utenti.username, post.data_ora')
            ->join('utenti', 'post.id_user = utenti.id_user')
            ->where('post.id_topic', $id_topic)
            //Magica funzione di CodeIgniter per la paginazione
            ->paginate($perPage);
---
SELECT COUNT(*) AS `numrows`
FROM `post`
JOIN `utenti` ON `post`.`id_user` = `utenti`.`id_user`
WHERE `post`.`id_topic` = '20'