app/Models/TopicPageModel.php

SELECT `post`.`testo`, `utenti`.`username`, `post`.`data_ora`
FROM `post`
JOIN `utenti` ON `post`.`id_user` = `utenti`.`id_user`
WHERE `post`.`id_topic` = '1'
---
    public function getTopicPosts($id_topic)
    {
        return $this->select('post.testo, utenti.username, post.data_ora')
            ->join('utenti', 'post.id_user = utenti.id_user')
            ->where('post.id_topic', $id_topic)
            ->findAll();